Documents/ЗаявкаНаПередачуЖивотногоВПриют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПередачуЖивотногоВПриют</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикАдминистративныхМероприятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опекун</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпекуныУкотовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПередачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПередачиВПриют</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВизита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ГрафикАдминистративныхМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикАдминистративныхМероприятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаПередачуЖивотногоВПриют/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Мероприятие = Справочники.АдминистративныеМероприятия.ПриемЖивотного;
	
	// регистр ГрафикАдминистративныхМероприятий
	Движения.ГрафикАдминистративныхМероприятий.Записывать = Истина;
	Движение = Движения.ГрафикАдминистративныхМероприятий.Добавить();
	Движение.Период = Дата;
	Движение.Мероприятие = Мероприятие;
	Движение.ДатаНачала = ВремяВизита;

КонецПроцедуры
